app/Controllers/ArquivoUpload.php

    public function index()
    {
        //
        $model = new ArquivoModel();
        $data['imagens'] = $model->findAll();
---
SELECT *
FROM `arquivos`
WHERE `arquivos`.`deleted_at` IS NULL

    public function upload()
    {
        //dd($this->request->getFile('imagem'));
        $modelArquivo = new ArquivoModel();
        $nome = $this->request->getPost('nome');
        $descricao = $this->request->getPost('descricao');
        $imagem = $this->request->getFile('imagem');
        $nomeAleatorioArquivo = $imagem->getRandomName();
        $imagem->move('uploads', $nomeAleatorioArquivo);

        $ArquivoDados = [
            'nome' => $nome,
            'imagem' => 'uploads/' . $nomeAleatorioArquivo,
            'descricao' => $descricao
        ];

        $modelArquivo->save($ArquivoDados);
---
INSERT INTO `arquivos` (`nome`, `imagem`, `descricao`, `created_at`, `updated_at`) VALUES ('arquivo 1', 'uploads/1722280027_b6e3e2fe5758c7cab907.webp', 'arq 1', '2024-07-29 16:07:07', '2024-07-29 16:07:07')

    public function editar()
    {
        //dd($this->request->getPost());
        $id_arquivo = $this->request->getPost('id_arquivo');
        $model = new ArquivoModel();
        $data['arquivo'] = $model->find($id_arquivo);
---
SELECT *
FROM `arquivos`
WHERE `arquivos`.`deleted_at` IS NULL
AND `arquivos`.`id_arquivo` = '2'

    public function atualizar()
    {
        $id_arquivo = $this->request->getPost('id_arquivo');
        $model = new ArquivoModel();
        $arquivo = $model->find($id_arquivo);
        $imagem = $this->request->getFile('imagem');

        if (empty($imagem) == true || $imagem == null || $imagem == '') {
            $data['imagem'] = $arquivo['imagem'];
            //echo 'imagem vazia';
        } else {
            if ($imagem->isValid() && !$imagem->hasMoved()) {
               // dd($imagem);
                if (file_exists($arquivo['imagem'])) {
                    unlink($arquivo['imagem']);
                }
                $imagemNome = $imagem->getRandomName();
                $imagem->move('uploads', $imagemNome);
                $data['imagem'] = 'uploads/' .$imagemNome;
                //echo 'imagem não vazia';
            }
        }

        $data['nome'] = $this->request->getPost('nome');
        $data['descricao'] = $this->request->getPost('descricao');
        $model->update($id_arquivo, $data);
---
SELECT *
FROM `arquivos`
WHERE `arquivos`.`deleted_at` IS NULL
AND `arquivos`.`id_arquivo` = '1'
UPDATE `arquivos` SET `imagem` = 'uploads/1722280044_b57558d8f3e649ec86e4.jpg', `nome` = 'arquivo 1', `descricao` = 'arq 1', `updated_at` = '2024-07-29 16:07:24'
WHERE `arquivos`.`id_arquivo` IN ('1')

    public function excluir()
    {
        $id_arquivo = $this->request->getPost('id_arquivo');
        $model = new ArquivoModel();
        $arquivo = $model->find($id_arquivo);
        if (file_exists($arquivo['imagem'])) {
            unlink($arquivo['imagem']);
        }
        $model->delete($id_arquivo);
---
SELECT *
FROM `arquivos`
WHERE `arquivos`.`deleted_at` IS NULL
AND `arquivos`.`id_arquivo` = '1'
UPDATE `arquivos` SET `deleted_at` = '2024-07-29 16:07:33', `updated_at` = '2024-07-29 16:07:33'
WHERE `id_arquivo` IN ('1')
AND `deleted_at` IS NULL